Tekla Open API Reference for Tekla Structures 2025
CoordinateSystem Constructor
Overload List
Name | Description
CoordinateSystem()
 Instantiates a coordinate system in the current work plane.
CoordinateSystem(Point, Vector, Vector)
 Instantiates a coordinate system with the given origin, X-axis and Y-axis.
Top
See Also
Reference
CoordinateSystem Class
Tekla.Structures.Geometry3d Namespace